{
  "skills": [
    {
      "header": "Skills",
      "items": [
        {
          "title": "Languages/Libraries",
          "details": [
            "Java - JavaFX, JUnit",
            "Python - OpenCV, Tensorflow, Qt, Tkinter",
            "JavaScript - Vanilla, TypeScript",
            "C# - ASP.NET Core/Web API",
            "HTML/CSS - Vanilla, Bootstrap",
            "PHP",
            "R - ggplot2"
          ]
        },
        {
          "title": "Frameworks",
          "details": [
            "Node.js",
            "React/React Native",
            "Svelte",
            "JQuery",
            "Flask"
          ]
        },
        {
          "title": "Database",
          "details": [
            "mySQL",
            "PostgreSQL",
            "Firebase"
          ]
        },
        {
          "title": "Cloud",
          "details": [
            "Amazon Web Services",
            "Docker"
          ]
        }
      ]
    },
    {
      "header": "Education",
      "items": [
        {
          "title": "Master of Software Development (MSwDev)",
          "date": "Victoria University of Wellington, 2024 - Present"
        },
        {
          "title": "Postgraduate Certificate in Health (PgCertHSc), Digital Health",
          "date": "University of Auckland, 2022 - 2023"
        },
        {
          "title": "Bachelor of Pharmacy (BPharm), Distinction",
          "date": "University of Otago, 2018 - 2022"
        }
      ]
    }
  ],
  "experience": [
    {
      "header": "Experience",
      "items": [
        {
          "title": "Locum/Staff Pharmacist",
          "date": "Various sites, 2022 - Present",
          "details": [
            "Adapted to diverse pharmacy environments ranging from larger interdisciplinary teams to sole charge.",
            "Demonstrated technical adaptability in using pharmacy technologies, including dispensing (Toniq, RxOne) and robotic systems (Alpaca, Cretem).",
            "Facilitated the seamless integration of digital resources like the Salesforce-authenticated Covid Immunisation Register and Electronic Health Record systems (ReCare and Concerto)."
          ]
        },
        {
          "title": "Science and Technical Intern",
          "date": "Ministry of Health, Nov 2020 - Dec 2020",
          "details": [
            "Conducted data analysis on internally stored health data utilising Tableau and Qlik dashboards.",
            "Analysed clinical trial results to create technical documentation and presentation materials on COVID-19 treatments and vaccines.",
            "Contributed to rapid reviews through presentations on collated research, collaborating with multidisciplinary teams to share insights."
            ]
        },
        {
          "title": "Clinical Data Entry Intern",
          "date": "New Zealand Formulary, June 2021",
          "details": [
            "Cross-referenced international clinical data sources (British Formulary, Dynamed, Martindale) to maintain accurate and current monograph information.",
            "Perform clinical checks on API data and patient leaflets, identifying discrepancies and ensuring necessary instructions and warnings were present."
          ]
        },
        {
          "title": "Volunteer Consultant",
          "date": "Ignite Consultants, Mar 2020 - June 2020",
          "details": [
            "Collaborated with a team of 6 members to deliver business advice to a non-profit organization.",
            "Conducted comprehensive risk management and stakeholder analysis, providing technical solutions and support for clients’ long-term goals.",
            "Created a comprehensive report and presented findings to stakeholders, communicating of complex concepts in client-centric language."          
            ]
        }
      ]
    },
    {
      "header": "Research",
      "items": [
        {
          "title": "AI driven clinical decision-making for antibiotic resistance",
          "date": "University of Auckland (2023)",
          "details": [
            "A capstone research project designing an AI-driven clinical decision support system (CDSS) collating antibiotic prescribing guidelines, regional susceptibility reports, and anonymised patient resistance data for precise antibiotic prescribing."
          ]
        },
        {
          "title": "Investigating pharmacist use of electronic health records",
          "date": "University of Otago (2021)",
          "details": [
            "A capstone research project analysing the use of electronic health records (EHR) and clinical decision support systems (CDSS) in New Zealand community pharmacies."
          ]
        }
      ]
    }
  ]
}